---
layout: default
title: Datenschutzerkl&auml;rung
---
<h2>Datenschutzerkl&auml;rung</h2>

<p>
Wir nehmen den Schutz pers&ouml;nlicher Daten sehr ernst. Wir behandeln personenbezogene Daten vertraulich entsprechend der gesetzlichen Vorschriften und dieser Datenschutzerkl&auml;rung.
</p>

<h3>Allgemeiner Hinweis und Pflichtinformationen</h3>

<h4>Benennung der verantwortlichen Stelle</h4>
<p>
Die verantwortliche Stelle f&uuml;r die Datenverarbeitung auf dieser Website ist:
</p>
<p>
Thomas Fahle<br />
Am Rosengarten 20<br />
D-36037 Fulda<br />
Deutschland<br />
</p>

<h4>Widerruf Ihrer Einwilligung zur Datenverarbeitung</h4>
<p>
Nur mit Ihrer ausdr&uuml;cklichen Einwilligung sind einige Vorg&auml;nge der Datenverarbeitung m&ouml;glich. Ein Widerruf Ihrer bereits erteilten Einwilligung ist jederzeit m&ouml;glich. F&uuml;r den Widerruf gen&uuml;gt eine <a href="/impressum.html">formlose Mitteilung per E-Mail</a>. Die Rechtm&auml;&szlig;igkeit der bis zum Widerruf erfolgten Datenverarbeitung bleibt vom Widerruf unber&uuml;hrt.
</p>

<h4>Recht auf Auskunft, Berichtigung, Sperrung, L&ouml;schung</h4>
<p>
Sie haben jederzeit im Rahmen der geltenden gesetzlichen Bestimmungen das Recht auf unentgeltliche Auskunft &uuml;ber Ihre gespeicherten personenbezogenen Daten, Herkunft der Daten, deren Empf&auml;nger und den Zweck der Datenverarbeitung und ggf. ein Recht auf Berichtigung, Sperrung oder L&ouml;schung dieser Daten. Diesbez&uuml;glich und auch zu weiteren Fragen zum Thema personenbezogene Daten k&ouml;nnen Sie sich jederzeit &uuml;ber die im <a href="/impressum.html">Impressum</a> aufgef&uuml;hrten Kontaktm&ouml;glichkeiten an uns wenden.
</p>

<h4>Recht auf Daten&uuml;bertragbarkeit</h4>
<p>
Ihnen steht das Recht zu, Daten, die wir auf Grundlage Ihrer Einwilligung oder in Erf&uuml;llung eines Vertrags automatisiert verarbeiten, an sich oder an Dritte aush&auml;ndigen zu lassen. Die Bereitstellung erfolgt in einem maschinenlesbaren Format. Sofern Sie die direkte &Uuml;bertragung der Daten an einen anderen Verantwortlichen verlangen, erfolgt dies nur, soweit es technisch machbar ist.
</p>

<h4>Recht auf Beschwerde bei der zust&auml;ndigen Aufsichtsbeh&ouml;rde</h4>
<p>
Als Betroffener steht Ihnen im Falle eines datenschutzrechtlichen Versto&szlig;es ein Beschwerderecht bei der zust&auml;ndigen Aufsichtsbeh&ouml;rde zu. Zust&auml;ndige Aufsichtsbeh&ouml;rde bez&uuml;glich datenschutzrechtlicher Fragen ist der Landesdatenschutzbeauftragte des Bundeslandes, in dem sich der Sitz unseres Unternehmens befindet.
</p>
<p>
F&uuml;r das Bundesland Hessen:
</p>
<ul>
 <li><a href="https://www.bfdi.bund.de/SharedDocs/Adressen/LfD/Hessen.html">Der Hessische Datenschutzbeauftragte (Anschrift)</a></li>
 <li><a href="https://datenschutz.hessen.de">Der Hessische Datenschutzbeauftragte (Homepage)</a></li>
</ul>

<h3>SSL- bzw. TLS-Verschl&uuml;sselung</h3>
<p>
Aus Sicherheitsgr&uuml;nden und zum Schutz der &Uuml;bertragung vertraulicher Inhalte, die Sie an uns als Seitenbetreiber senden, nutzt unsere Website eine SSL-bzw. TLS-Verschl&uuml;sselung. Damit sind Daten, die Sie &uuml;ber diese Website &uuml;bermitteln, f&uuml;r Dritte nicht mitlesbar. Sie erkennen eine verschl&uuml;sselte Verbindung an der <em>"https://"</em> Adresszeile Ihres Browsers.
</p>

<h3>Kontaktaufnahme</h3>
<p>
Bei der Kontaktaufnahme (zum Beispiel per Kontaktformular oder E-Mail) werden die Angaben des Nutzers zwecks Bearbeitung der Anfrage sowie f&uuml;r den Fall, dass Anschlussfragen entstehen, gespeichert.
</p>
<p>
Eine weitergehende &Uuml;bermittlung der Daten findet nicht statt bzw. nur dann, wenn Sie dieser ausdr&uuml;cklich zugestimmt haben.
</p>
<p>
Grundlage f&uuml;r die Datenverarbeitung ist Art. 6 Abs. 1 lit. b DSGVO, der die Verarbeitung von Daten zur Erf&uuml;llung eines Vertrags oder vorvertraglicher Ma&szlig;nahmen gestattet.
</p>

<h3>Daten-Erhebung durch Dritte</h3>

<h4>Daten-Erhebung durch die Nutzung von GitHub Pages</h4>
 <p>
 Diese Website wird auf Servern von <a href="https://www.github.com">Github Inc., 88 Colin P Kelly Jr St, San Francisco, CA 94107, USA</a> gehostet. Beachten Sie daher auch die <a href="https://help.github.com/articles/github-privacy-policy/">GitHub Privacy Policy</a> und <a href="https://help.github.com/articles/global-privacy-practices/">GitHub Global Privacy Practices</a>.
</p>
<p>
Github verf&uuml;gt &uuml;ber eine Zertifizierung nach dem <em>EU-US-Privacy-Shield</em>. Der <em>Privacy-Shield</em> ist ein &Uuml;bereinkommen zwischen der Europ&auml;ischen Union (EU) und den USA, das die Einhaltung europ&auml;ischer Datenschutzstandards in den USA gew&auml;hrleisten soll. Siehe dazu die <a href="https://www.privacyshield.gov/participant?id=a2zt000000001K2AAI&status=Active">Privacy Shield Compliance Erkl&auml;rung</a> von Github.
</p>


<h4>Daten-Erhebung durch die Nutzung von Youtube Videos </h4>
<p>
Diese Website bindet YouTube-Videos im <em>Erweiterten Datenschutzmodus</em> ein, um Ihnen Videos anzeigen zu k&ouml;nnen.
</p>
<p>
Hierbei handelt es sich um ein Videoportal der <a href="https://www.youtube.com"> YouTube LLC., 901 Cherry Ave., 94066 San Bruno, CA, USA</a>, nachfolgend <em>YouTube</em> genannt.
</p>
<p>
YouTube ist ein Tochterunternehmen der<a href="https://www.google.com/">Google LLC., 1600 Amphitheatre Parkway, Mountain View, CA 94043 USA</a>, nachfolgend <em>Google</em> genannt.
<p>
Google und damit auch das Tochterunternehmen YouTube verf&uuml;gt &uuml;ber eine Zertifizierung nach dem <em>EU-US-Privacy-Shield</em>. Der <em>Privacy-Shield</em> ist ein &Uuml;bereinkommen zwischen der Europ&auml;ischen Union (EU) und den USA, das die Einhaltung europ&auml;ischer Datenschutzstandards in den USA gew&auml;hrleisten soll. Siehe dazu die <a href="https://www.privacyshield.gov/participant?id=a2zt000000001L5AAI&status=Active">Privacy Shield Compliance Erkl&auml;rung</a> von Google.
</p>
<p>
Die Funktion <em>Erweiterter Datenschutzmodus</em> bewirkt laut Angaben von YouTube, dass die nachfolgend noch n&auml;her bezeichneten Daten nur dann an den Server von YouTube &uuml;bermittelt werden, wenn Sie ein Video auch tats&auml;chlich starten.
</p>
<p>
Ohne diesen <em>Erweiterten Datenschutz</em> wird eine Verbindung zum Server von YouTube in den USA hergestellt, sobald Sie eine unserer Internetseiten, auf der ein YouTube-Video eingebettet ist, aufrufen.
</p>
<p>
Diese Verbindung ist erforderlich, um das jeweilige Video auf unserer Internetseite &uuml;ber Ihren Internet-Browser darstellen zu k&ouml;nnen. Im Zuge dessen wird YouTube zumindest Ihre IP-Adresse, das Datum nebst Uhrzeit sowie die von Ihnen besuchte Internetseite erfassen und verarbeiten. Zudem wird eine Verbindung zu dem Werbenetzwerk „DoubleClick“ von Google hergestellt.
</p>
<p>
Sollten Sie gleichzeitig bei YouTube eingeloggt sein, weist YouTube die Verbindungsinformationen Ihrem YouTube-Konto zu. Wenn Sie das verhindern m&ouml;chten, m&uuml;ssen Sie sich entweder vor dem Besuch unseres Internetauftritts bei YouTube ausloggen oder die entsprechenden Einstellungen in Ihrem YouTube-Benutzerkonto vornehmen.
</p>
<p>
Zum Zwecke der Funktionalit&auml;t sowie zur Analyse des Nutzungsverhaltens speichert YouTube dauerhaft Cookies &uuml;ber Ihren Internet-Browser auf Ihrem Endger&auml;t. Falls Sie mit dieser Verarbeitung nicht einverstanden sind, haben Sie die M&ouml;glichkeit, die Speicherung der Cookies durch eine Einstellung in Ihrem Internet-Browsers zu verhindern.
</p>
<p>
Weitergehende Informationen &uuml;ber die Erhebung und Nutzung von Daten sowie Ihre diesbez&uuml;glichen Rechte und Schutzm&ouml;glichkeiten h&auml;lt Google in den unter <a href="https://policies.google.com/privacy">abrufbaren Datenschutzhinweisen bereit.</a>
</p>

<h4>Daten-Erhebung durch die Nutzung von twit.tv Videos</h4>
<p>
Diese Website bindet twit.tv-Videos ein.
</p>
<p>
Hierbei handelt es sich um ein Videoportal der <a href="https://twit.tv/about/contact">TWiT LLC, 1351-B Redwood Way Petaluma, CA 94954, USA</a>, nachfolgend <em>twit.tv</em> genannt.
</p>
<p>
Zum Zwecke der Funktionalit&auml;t sowie zur Analyse des Nutzungsverhaltens speichert twit.tv dauerhaft Cookies &uuml;ber Ihren Internet-Browser auf Ihrem Endger&auml;t. Falls Sie mit dieser Verarbeitung nicht einverstanden sind, haben Sie die M&ouml;glichkeit, die Speicherung der Cookies durch eine Einstellung in Ihrem Internet-Browsers zu verhindern.
</p>
<p>
Weitergehende Informationen &uuml;ber die Erhebung und Nutzung von Daten sowie Ihre diesbez&uuml;glichen Rechte und Schutzm&ouml;glichkeiten h&auml;lt twit.tv in den unter <a href="https://twit.tv/about/privacy">abrufbaren Datenschutzhinweisen bereit.</a>
</p>

