---
layout: post
title: POP3 via Telnet
date: '2008-06-24 17:12:21 +0000'
mt_id: 78
blog_id: 1
post_id: 78
permalink: /2008/06/pop3-via-telnet.html
categories:
- email
---
<p>
Nach einer knappen Übersicht der POP3-Kommandos gemäß <a href="http://www.faqs.org/rfcs/rfc1225.html">RFC 1225</a> führt Sie diese Seite durch eine Telnet-Beispielsitzung mit einem POP3-Server, die Ihnen zeigt, wie Anfragen und Antworten zwischen Client und Server ablaufen.
</p>

<h2>POP3 Kommandos (RFC 1225)</h2>

<dl>
<dt>APOP</dt>
<dd> Verschlüsseltes Einloggen (Optional)</dd>

<dt>DELE</dt>
<dd>Markiert eine Nachricht als gelöscht.</dd>

<dt>LAST</dt>
<dd>Gibt die höchste bisher bearbeitete Nachrichtennummer zurück.</dd>

<dt>LIST</dt>
<dd>Gibt die Größe der Nachricht(en) zurück.</dd>

<dt>NOOP</dt>
<dd>No Operation, gibt einen positiven Wert zurück, falls der Server noch lebt.</dd>

<dt>PASS</dt>
<dd>Übermittelt das Passwort für USER im Klartext</dd>

<dt>RSET</dt>
<dd>Setzt die Markierung aller als gelöscht markierten Nachrichten zurück.</dd>

<dt>RETR</dt>
<dd>Holt eine komplette Nachricht (Head und Body).</dd>

<dt>STAT</dt>
<dd>Ermittelt die Anzahl der vorhandenen Nachrichten und die Größe der Mailbox.</dd>

<dt>TOP</dt>
<dd>Holt den Header und die angegebenen Zeilen der Nachricht.<br />
TOP 10 5 holt den Header und die ersten 5 Zeilen von Nachricht 10.
<br />(Optional)</dd>

<dt>UIDL</dt>
<dd> (<b>U</b>nique <b>ID L</b>isting)
Fragt nach der eindeutigen Kennung der Nachricht.<br />(Optional)</dd>

<dt>USER</dt>
<dd>Übermittelt den Usernamen für die Mailbox (maildrop)</dd>

<dt>QUIT</dt>
<dd>Beendet die Verbindung. Löscht alle als gelöscht markierten Mails.</dd>
</dl>


<h2>Eine POP3-Sitzung via Telnet</h2>
<p>
Unter Linux ist üblicherweise ein brauchbarer <a href="http://de.wikipedia.org/wiki/Telnet">Telnet</a>-Client vorhanden. Windows-Usern empfehle ich <a href="http://www.chiark.greenend.org.uk/~sgtatham/putty/download.html">PuTTYtel</a> oder <a href="http://www.hilgraeve.com/hyperterminal.html">HyperTerminal Private Edition</a>.
</p>
<p>
Ein POP3-Server ist üblicherweise an Port 110 gebunden.
</p>
<pre>
telnet localhost 110
</pre>
<p>
Verbindungsaufbau
</p>
<pre>
Trying 127.0.0.1...
Connected to localhost.
Escape character is '^]'.
+OK QPOP (version 2.2) at 127.0.0.1 starting.
</pre>
<p>
Login
</p>
<pre>
user thomas
+OK Password required for thomas.
pass xxxxxxx
+OK thomas has 8 messages (3371 octets).
</pre>
<p>
Sobald Sie eingeloggt sind, sperrt der POP3-Server Ihr Postfach,<br />
so daß von keiner anderen Stelle Nachrichten entfernt oder verändert werden können. (Transaktionsphase)
</p>
<p>
Die Grösse aller Nachrichten anzeigen.
</p>
<pre>
LIST
+OK 8 messages (3371 octets)
1 510
2 412
3 413
4 376
5 374
6 409
7 455
8 422
.
</pre>
<p>
Die Grösse der Nachricht Nr. 8 anzeigen.
</p>
<pre>
LIST 8
+OK 8 422
</pre>
<p>
Header und die ersten fünf Zeilen von Nachricht Nr. 8 anzeigen.
</p>
<pre>
TOP 8 5
+OK 422 octets
Return-Path: &lt;thomas&gt;
Received: (from thomas@localhost)
        by localhost (8.8.8/8.8.8) id OAA00987
        for thomas; Tue, 22 Feb 2000 23:55:27 +0100
Date: Tue, 22 Feb 2000 23:55:27 +0100
From: thomas@localhost
Message-Id: &lt;200002221355.OAA00987@localhost&gt;
To: thomas@localhost
Subject: Perl und POP3
X-UIDL: 6be48a973d87a776ed1fd0135e28b0c2

Hallo Thomas,

Weisst du, wie man POP3-Server mit Perl anzapft?

CU
.
</pre>
<p>
Nachricht Nr. 1 komplett (Header und Body) anzeigen.
</p>
<pre>
RETR 1
+OK 510 octets
Return-Path: &lt;thomas&gt;
Received: (from thomas@localhost)
        by localhost (8.8.8/8.8.8) id OAA00917
        for thomas; Tue, 22 Feb 2000 23:47:46 +0100
Date: Tue, 22 Feb 2000 23:47:46 +0100
From: thomas@localhost
Message-Id: &lt;000002221347.OAA00917@localhost&gt;
To: thomas@localhost
Subject: Teste POP3
X-UIDL: 65d35b6764e2fc801f68323ba9288945
Status: U

Hallo Thomas,

spiel nicht soviel an irgenwelchen Servern rum.
Schlaf mal wieder ne Nacht
.
</pre>
<p>
Eindeutige Kennung der Nachricht Nr. 1 ermitteln
</p>
<pre>
UIDL 1
+OK 1 65d35b6764e2fc801f68323ba9288945
</pre>
<p>
Nachricht Nr. 1 löschen
</p>
<pre>
DELE 1
+OK Message 1 has been deleted.
</pre>
<p>
Alle als gelöscht markierten Nachrichten wieder herstellen
</p>
<pre>
RSET
+OK Maildrop has 8 messages (3449 octets)
</pre>
<p>
Wie gross ist die Mailbox jetzt?
</p>
<pre>
STAT
+OK 8 3449
</pre>
<p>
Lebt der Server noch?
</p>
<pre>
NOOP
+OK
</pre>
<p>
Die Verbindung ordungsgemäss beenden. <br />
Als gelöscht markierte Nachrichten werden jetzt gelöscht.
</p>
<pre>
QUIT
+OK Pop server at localhost signing off.
</pre>

<h2>Siehe auch</h2>

<ul class="no-bullet">
<li><a href="http://www.faqs.org/rfcs/rfc1225.html">RFC 1225</a></li>
<li><a href="http://de.wikipedia.org/wiki/POP3">Post Office Protocol</a></li>
<li><a href="http://www.elektronik-kompendium.de/sites/net/0903091.htm">POP3 - Post Office Protocol Version 3</a></li>
</ul>
