---
layout: post
title: 'Talk: Renée Bäcker - The Renaissance of Perl - Was sich in den letzten Jahren
  bei Perl5 getan hat'
date: '2013-12-16 22:15:00 +0000'
mt_id: 252
blog_id: 1
post_id: 252
permalink: /2013/12/talk_renee_backer_the_renaissance_of_perl_-_was_sich_in_den_letzten_jahren_bei_perl5_getan_hat.html
categories:
- talks
---
<p>
<a href="http://www.perl-services.de/">Ren&eacute;e B&auml;cker</a> hat den Vortrag <i>The Renaissance of Perl - Was sich in den letzten Jahren bei Perl5 getan hat</i> auf der <a href="http://programm.froscon.org/2013/events/1128.html">FrOSCon 2013</a> (<a href="https://speakerdeck.com/reneeb_perl/the-renaissance-of-perl">Slides</a>, <a href="http://media.ccc.de/browse/conferences/froscon/2013/hs3_-_2013-08-25_10:00_-_the_renaissance_of_perl_-_renee_backer_-_1128.html">Video Mitschnitt</a>) und auf der <a href="http://programm.openrheinruhr.de/2013/events/177.de.html">OpenRheinRuhr 2013</a> (<a href="https://speakerdeck.com/reneeb_perl/openrheinruhr-the-renaissance-of-perl">Slides</a>) gehalten. 
</p>
<p>
Sowohl auf der <a href="http://www.froscon.de/startseite/">FrOSCon</a> als auch auf der <a href="http://openrheinruhr.de/">OpenRheinRuhr</a> waren nach dem Vortag einige Besucher am Perl-Stand und haben sich bei Ren&eacute;e ausdr&uuml;cklich für diesen Vortrag bedankt. Den meisten war nicht wirklich klar, was sich so alles ge&auml;ndert hat und welche coolen Tools es inzwischen gibt.  
</p>
<p>
Es lohnt sich!
</p>


<p>&nbsp;</p>

<h2>Ank&uuml;ndigung des Vortrags</h2>
<p>
<a href="http://www.perl.org">Perl</a> ist alt und riecht schon leicht modrig.
</p>
<p>
Das denken auf jeden Fall die Personen, die sich schon l&auml;nger nicht mehr mit Perl besch&auml;ftigt haben.
</p>
<p>
Dabei hat sich in den letzten Jahren einiges -- auch innerhalb der Perl-Community -- getan.</p>
<p>
Dieser Vortrag stellt einige dieser Neuerungen vor.
</p>
<ol>
<li>Perl ist unleserlich! Das kann man machen, (muss|sollte) man aber nicht.</li>
<li>Perl ist bei Perl 5 stehen geblieben. Die Sprache hei&szlig;t <b>Perl5</b> und ist in der <a href="http://www.perl.org/get.html">Version 18.1</a> ver&ouml;ffentlicht (Perl5 18.1 kam im Mai 2013 heraus).</li>
<li>Perl5 + Web = CGI.pm. Ja, vor &uuml;ber 10 Jahren. Heute benutzt man andere Techniken.</li>
<li>Das Objektsystem in Perl5 ist so umst&auml;ndlich. Ein <a href="http://moose.perl.org">Elch</a> und sein Gefolge kann helfen!</li>
<li>Das Bauen und Ausliefern von Perl5-Paketen ist umst&auml;ndlich. Nicht wenn man seine Tools kennt.</li>
</ol>

<p>
Diese f&uuml;nf Punkte zeigen, dass sich in den letzten Jahren einiges getan hat. <a href="http://www.perl-services.de/">Ren&eacute;e B&auml;cker</a>
 m&ouml;chte den Zuh&ouml;rern diese &Auml;nderungen zeigen und zum Einsatz der Features und Pakete ermuntern. 
</p>

<p>&nbsp;</p>
<h2>Video des Vortrags</h2>


<div id="cccPlayer" style="width: 640px; height: 360px; text-align: center;">
 <video
   controls="controls"
   poster="http://static.media.ccc.de/media/conferences/froscon/2013/hs3_-_2013-08-25_10_00_-_the_renaissance_of_perl_-_renee_backer_-_1128_preview.jpg"
   width="640" height="360" >
   <source type="video/webm" src="http://cdn.media.ccc.de/events/froscon/2013/webm/hs3_-_2013-08-25_10_00_-_the_renaissance_of_perl_-_renee_backer_-_1128.webm"></source>
              
   <source type="video/mp4" src="http://cdn.media.ccc.de/events/froscon/2013/mp4/hs3_-_2013-08-25_10_00_-_the_renaissance_of_perl_-_renee_backer_-_1128.mp4"></source>

   <div> Schade - hier k&auml;me ein Video, wenn Ihr Browser HTML 5 Unterst&uuml;tzung h&auml;tte, wie z.B. der aktuelle Firefox</div>
              
 </video>
</div>


<p>&nbsp;</p>
<h2>Slides des Vortrags auf der FrOSCon</h2>
 <script async class="speakerdeck-embed" data-id="6cee5f20efab01306be20e538cdc0a52" data-ratio="1.33507170795306" src="//speakerdeck.com/assets/embed.js"></script> 

<p>&nbsp;</p>
<p>&nbsp;</p>
